---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRailingsStringer
source: html/e7c0fed8-674f-6a41-54d6-31eea4829940.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRailingsStringer Property

Railings and Stringers will not be automatically generated due to bad Runs. This message may be incorrect if you have Edited the Sketch and modified some dimensions.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRailingsStringer { get; }
```